hboughardain/MEMO-H504/PIC32CM5164LS00/Secure/firmware/src/packs/PIC32CM5164LS00064_DFP/component/dsu.h
#define DSU_LENGTH_LENGTH_Pos                 _UINT32_(2)                                          /* (DSU_LENGTH) Length Position */
#define DSU_LENGTH_LENGTH_Msk                 (_UINT32_(0x3FFFFFFF) << DSU_LENGTH_LENGTH_Pos)      /* (DSU_LENGTH) Length Mask */
#define DSU_LENGTH_LENGTH(value)              (DSU_LENGTH_LENGTH_Msk & (_UINT32_(value) << DSU_LENGTH_LENGTH_Pos)) /* Assigment of value for LENGTH in the DSU_LENGTH register */
#define DSU_LENGTH_Msk                        _UINT32_(0xFFFFFFFC)                                 /* (DSU_LENGTH) Register Mask  */


/* -------- DSU_DATA : (DSU Offset: 0x0C) (R/W 32) Data -------- */
#define DSU_DATA_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_DATA) Data  Reset Value */

#define DSU_DATA_DATA_Pos                     _UINT32_(0)                                          /* (DSU_DATA) Data Position */
#define DSU_DATA_DATA_Msk                     (_UINT32_(0xFFFFFFFF) << DSU_DATA_DATA_Pos)          /* (DSU_DATA) Data Mask */
#define DSU_DATA_DATA(value)                  (DSU_DATA_DATA_Msk & (_UINT32_(value) << DSU_DATA_DATA_Pos)) /* Assigment of value for DATA in the DSU_DATA register */
#define DSU_DATA_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (DSU_DATA) Register Mask  */


/* -------- DSU_DCC : (DSU Offset: 0x10) (R/W 32) Debug Communication Channel n -------- */
#define DSU_DCC_RESETVALUE                    _UINT32_(0x00)                                       /*  (DSU_DCC) Debug Communication Channel n  Reset Value */

#define DSU_DCC_DATA_Pos                      _UINT32_(0)                                          /* (DSU_DCC) Data Position */
#define DSU_DCC_DATA_Msk                      (_UINT32_(0xFFFFFFFF) << DSU_DCC_DATA_Pos)           /* (DSU_DCC) Data Mask */
#define DSU_DCC_DATA(value)                   (DSU_DCC_DATA_Msk & (_UINT32_(value) << DSU_DCC_DATA_Pos)) /* Assigment of value for DATA in the DSU_DCC register */
#define DSU_DCC_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (DSU_DCC) Register Mask  */


/* -------- DSU_DID : (DSU Offset: 0x18) ( R/ 32) Device Identification -------- */
#define DSU_DID_RESETVALUE                    _UINT32_(0x20860100)                                 /*  (DSU_DID) Device Identification  Reset Value */

#define DSU_DID_DEVSEL_Pos                    _UINT32_(0)                                          /* (DSU_DID) Device Select Position */
#define DSU_DID_DEVSEL_Msk                    (_UINT32_(0xFF) << DSU_DID_DEVSEL_Pos)               /* (DSU_DID) Device Select Mask */
#define DSU_DID_DEVSEL(value)                 (DSU_DID_DEVSEL_Msk & (_UINT32_(value) << DSU_DID_DEVSEL_Pos)) /* Assigment of value for DEVSEL in the DSU_DID register */
#define   DSU_DID_DEVSEL_512KB_64KB_100PIN_Val _UINT32_(0x0)                                        /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 100-pin  */
#define   DSU_DID_DEVSEL_512KB_64KB_64PIN_Val _UINT32_(0x1)                                        /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 64-pin  */
#define   DSU_DID_DEVSEL_512KB_64KB_48PIN_Val _UINT32_(0x2)                                        /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 48-pin  */
#define   DSU_DID_DEVSEL_256KB_32KB_100PIN_Val _UINT32_(0x4)                                        /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 100-pin  */
#define   DSU_DID_DEVSEL_256KB_32KB_64PIN_Val _UINT32_(0x5)                                        /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 64-pin  */
#define   DSU_DID_DEVSEL_256KB_32KB_48PIN_Val _UINT32_(0x6)                                        /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 48-pin  */
#define   DSU_DID_DEVSEL_128KB_16KB_48PIN_Val _UINT32_(0xA)                                        /* (DSU_DID) 128 KB Flash / 16 KB SRAM / 48-pin  */
#define   DSU_DID_DEVSEL_128KB_16KB_32PIN_Val _UINT32_(0xB)                                        /* (DSU_DID) 128 KB Flash / 16 KB SRAM / 32-pin  */
#define DSU_DID_DEVSEL_512KB_64KB_100PIN      (DSU_DID_DEVSEL_512KB_64KB_100PIN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 100-pin Position  */
#define DSU_DID_DEVSEL_512KB_64KB_64PIN       (DSU_DID_DEVSEL_512KB_64KB_64PIN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 64-pin Position  */
#define DSU_DID_DEVSEL_512KB_64KB_48PIN       (DSU_DID_DEVSEL_512KB_64KB_48PIN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 512 KB Flash / 64 KB SRAM / 48-pin Position  */
#define DSU_DID_DEVSEL_256KB_32KB_100PIN      (DSU_DID_DEVSEL_256KB_32KB_100PIN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 100-pin Position  */
#define DSU_DID_DEVSEL_256KB_32KB_64PIN       (DSU_DID_DEVSEL_256KB_32KB_64PIN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 64-pin Position  */
#define DSU_DID_DEVSEL_256KB_32KB_48PIN       (DSU_DID_DEVSEL_256KB_32KB_48PIN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 256 KB Flash / 32 KB SRAM / 48-pin Position  */
#define DSU_DID_DEVSEL_128KB_16KB_48PIN       (DSU_DID_DEVSEL_128KB_16KB_48PIN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 128 KB Flash / 16 KB SRAM / 48-pin Position  */
#define DSU_DID_DEVSEL_128KB_16KB_32PIN       (DSU_DID_DEVSEL_128KB_16KB_32PIN_Val << DSU_DID_DEVSEL_Pos) /* (DSU_DID) 128 KB Flash / 16 KB SRAM / 32-pin Position  */
#define DSU_DID_REVISION_Pos                  _UINT32_(8)                                          /* (DSU_DID) Revision Number Position */
#define DSU_DID_REVISION_Msk                  (_UINT32_(0xF) << DSU_DID_REVISION_Pos)              /* (DSU_DID) Revision Number Mask */
#define DSU_DID_REVISION(value)               (DSU_DID_REVISION_Msk & (_UINT32_(value) << DSU_DID_REVISION_Pos)) /* Assigment of value for REVISION in the DSU_DID register */
#define DSU_DID_DIE_Pos                       _UINT32_(12)                                         /* (DSU_DID) Die Number Position */
#define DSU_DID_DIE_Msk                       (_UINT32_(0xF) << DSU_DID_DIE_Pos)                   /* (DSU_DID) Die Number Mask */
#define DSU_DID_DIE(value)                    (DSU_DID_DIE_Msk & (_UINT32_(value) << DSU_DID_DIE_Pos)) /* Assigment of value for DIE in the DSU_DID register */
#define DSU_DID_SERIES_Pos                    _UINT32_(16)                                         /* (DSU_DID) Series Position */
#define DSU_DID_SERIES_Msk                    (_UINT32_(0x3F) << DSU_DID_SERIES_Pos)               /* (DSU_DID) Series Mask */
#define DSU_DID_SERIES(value)                 (DSU_DID_SERIES_Msk & (_UINT32_(value) << DSU_DID_SERIES_Pos)) /* Assigment of value for SERIES in the DSU_DID register */
#define   DSU_DID_SERIES_LE00_Val             _UINT32_(0x5)                                        /* (DSU_DID) Low Power  */
#define   DSU_DID_SERIES_LS00_Val             _UINT32_(0x6)                                        /* (DSU_DID) Low Power and Security  */
#define   DSU_DID_SERIES_LS60_Val             _UINT32_(0x7)                                        /* (DSU_DID) Low Power and Security with CryptoAuthentication Device  */
#define DSU_DID_SERIES_LE00                   (DSU_DID_SERIES_LE00_Val << DSU_DID_SERIES_Pos)      /* (DSU_DID) Low Power Position  */
#define DSU_DID_SERIES_LS00                   (DSU_DID_SERIES_LS00_Val << DSU_DID_SERIES_Pos)      /* (DSU_DID) Low Power and Security Position  */
#define DSU_DID_SERIES_LS60                   (DSU_DID_SERIES_LS60_Val << DSU_DID_SERIES_Pos)      /* (DSU_DID) Low Power and Security with CryptoAuthentication Device Position  */
#define DSU_DID_FAMILY_Pos                    _UINT32_(23)                                         /* (DSU_DID) Family Position */
#define DSU_DID_FAMILY_Msk                    (_UINT32_(0x1F) << DSU_DID_FAMILY_Pos)               /* (DSU_DID) Family Mask */
#define DSU_DID_FAMILY(value)                 (DSU_DID_FAMILY_Msk & (_UINT32_(value) << DSU_DID_FAMILY_Pos)) /* Assigment of value for FAMILY in the DSU_DID register */
#define   DSU_DID_FAMILY_1_Val                _UINT32_(0x1)                                        /* (DSU_DID) PIC32CM Ultra-Low Power Entry Level Families  */
#define DSU_DID_FAMILY_1                      (DSU_DID_FAMILY_1_Val << DSU_DID_FAMILY_Pos)         /* (DSU_DID) PIC32CM Ultra-Low Power Entry Level Families Position  */
#define DSU_DID_PROCESSOR_Pos                 _UINT32_(28)                                         /* (DSU_DID) Processor Position */
#define DSU_DID_PROCESSOR_Msk                 (_UINT32_(0xF) << DSU_DID_PROCESSOR_Pos)             /* (DSU_DID) Processor Mask */
#define DSU_DID_PROCESSOR(value)              (DSU_DID_PROCESSOR_Msk & (_UINT32_(value) << DSU_DID_PROCESSOR_Pos)) /* Assigment of value for PROCESSOR in the DSU_DID register */
#define   DSU_DID_PROCESSOR_CM23_Val          _UINT32_(0x2)                                        /* (DSU_DID) Cortex-M23  */
#define DSU_DID_PROCESSOR_CM23                (DSU_DID_PROCESSOR_CM23_Val << DSU_DID_PROCESSOR_Pos) /* (DSU_DID) Cortex-M23 Position  */
#define DSU_DID_Msk                           _UINT32_(0xFFBFFFFF)                                 /* (DSU_DID) Register Mask  */


/* -------- DSU_CFG : (DSU Offset: 0x1C) (R/W 32) Configuration -------- */
#define DSU_CFG_RESETVALUE                    _UINT32_(0x02)                                       /*  (DSU_CFG) Configuration  Reset Value */

#define DSU_CFG_LQOS_Pos                      _UINT32_(0)                                          /* (DSU_CFG) Latency Quality Of Service Position */
#define DSU_CFG_LQOS_Msk                      (_UINT32_(0x3) << DSU_CFG_LQOS_Pos)                  /* (DSU_CFG) Latency Quality Of Service Mask */
#define DSU_CFG_LQOS(value)                   (DSU_CFG_LQOS_Msk & (_UINT32_(value) << DSU_CFG_LQOS_Pos)) /* Assigment of value for LQOS in the DSU_CFG register */
#define DSU_CFG_DCCDMALEVEL0_Pos              _UINT32_(2)                                          /* (DSU_CFG) DMA Trigger Level 0 Position */
#define DSU_CFG_DCCDMALEVEL0_Msk              (_UINT32_(0x1) << DSU_CFG_DCCDMALEVEL0_Pos)          /* (DSU_CFG) DMA Trigger Level 0 Mask */
#define DSU_CFG_DCCDMALEVEL0(value)           (DSU_CFG_DCCDMALEVEL0_Msk & (_UINT32_(value) << DSU_CFG_DCCDMALEVEL0_Pos)) /* Assigment of value for DCCDMALEVEL0 in the DSU_CFG register */
#define   DSU_CFG_DCCDMALEVEL0_READ_Val       _UINT32_(0x0)                                        /* (DSU_CFG) Signals to the DMA that a data is available for read  */
#define   DSU_CFG_DCCDMALEVEL0_WRITE_Val      _UINT32_(0x1)                                        /* (DSU_CFG) Signals to the DMA that a data is available for write  */
#define DSU_CFG_DCCDMALEVEL0_READ             (DSU_CFG_DCCDMALEVEL0_READ_Val << DSU_CFG_DCCDMALEVEL0_Pos) /* (DSU_CFG) Signals to the DMA that a data is available for read Position  */
#define DSU_CFG_DCCDMALEVEL0_WRITE            (DSU_CFG_DCCDMALEVEL0_WRITE_Val << DSU_CFG_DCCDMALEVEL0_Pos) /* (DSU_CFG) Signals to the DMA that a data is available for write Position  */
#define DSU_CFG_DCCDMALEVEL1_Pos              _UINT32_(3)                                          /* (DSU_CFG) DMA Trigger Level 1 Position */
#define DSU_CFG_DCCDMALEVEL1_Msk              (_UINT32_(0x1) << DSU_CFG_DCCDMALEVEL1_Pos)          /* (DSU_CFG) DMA Trigger Level 1 Mask */
#define DSU_CFG_DCCDMALEVEL1(value)           (DSU_CFG_DCCDMALEVEL1_Msk & (_UINT32_(value) << DSU_CFG_DCCDMALEVEL1_Pos)) /* Assigment of value for DCCDMALEVEL1 in the DSU_CFG register */
#define   DSU_CFG_DCCDMALEVEL1_READ_Val       _UINT32_(0x0)                                        /* (DSU_CFG) Signals to the DMA that a data is available for read  */
#define   DSU_CFG_DCCDMALEVEL1_WRITE_Val      _UINT32_(0x1)                                        /* (DSU_CFG) Signals to the DMA that a data is available for write  */
#define DSU_CFG_DCCDMALEVEL1_READ             (DSU_CFG_DCCDMALEVEL1_READ_Val << DSU_CFG_DCCDMALEVEL1_Pos) /* (DSU_CFG) Signals to the DMA that a data is available for read Position  */
#define DSU_CFG_DCCDMALEVEL1_WRITE            (DSU_CFG_DCCDMALEVEL1_WRITE_Val << DSU_CFG_DCCDMALEVEL1_Pos) /* (DSU_CFG) Signals to the DMA that a data is available for write Position  */
#define DSU_CFG_Msk                           _UINT32_(0x0000000F)                                 /* (DSU_CFG) Register Mask  */

#define DSU_CFG_DCCDMALEVEL_Pos               _UINT32_(2)                                          /* (DSU_CFG Position) DMA Trigger Level x */
#define DSU_CFG_DCCDMALEVEL_Msk               (_UINT32_(0x3) << DSU_CFG_DCCDMALEVEL_Pos)           /* (DSU_CFG Mask) DCCDMALEVEL */
#define DSU_CFG_DCCDMALEVEL(value)            (DSU_CFG_DCCDMALEVEL_Msk & (_UINT32_(value) << DSU_CFG_DCCDMALEVEL_Pos)) 

/* -------- DSU_BCC : (DSU Offset: 0x20) (R/W 32) Boot ROM Communication Channel n -------- */
#define DSU_BCC_RESETVALUE                    _UINT32_(0x00)                                       /*  (DSU_BCC) Boot ROM Communication Channel n  Reset Value */

#define DSU_BCC_DATA_Pos                      _UINT32_(0)                                          /* (DSU_BCC) Data Position */
#define DSU_BCC_DATA_Msk                      (_UINT32_(0xFFFFFFFF) << DSU_BCC_DATA_Pos)           /* (DSU_BCC) Data Mask */
#define DSU_BCC_DATA(value)                   (DSU_BCC_DATA_Msk & (_UINT32_(value) << DSU_BCC_DATA_Pos)) /* Assigment of value for DATA in the DSU_BCC register */
#define DSU_BCC_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (DSU_BCC) Register Mask  */


/* -------- DSU_ENTRY0 : (DSU Offset: 0x1000) ( R/ 32) CoreSight ROM Table Entry 0 -------- */
#define DSU_ENTRY0_RESETVALUE                 _UINT32_(0x9F0FC002)                                 /*  (DSU_ENTRY0) CoreSight ROM Table Entry 0  Reset Value */

#define DSU_ENTRY0_EPRES_Pos                  _UINT32_(0)                                          /* (DSU_ENTRY0) Entry Present Position */
#define DSU_ENTRY0_EPRES_Msk                  (_UINT32_(0x1) << DSU_ENTRY0_EPRES_Pos)              /* (DSU_ENTRY0) Entry Present Mask */
#define DSU_ENTRY0_EPRES(value)               (DSU_ENTRY0_EPRES_Msk & (_UINT32_(value) << DSU_ENTRY0_EPRES_Pos)) /* Assigment of value for EPRES in the DSU_ENTRY0 register */
#define DSU_ENTRY0_FMT_Pos                    _UINT32_(1)                                          /* (DSU_ENTRY0) Format Position */
#define DSU_ENTRY0_FMT_Msk                    (_UINT32_(0x1) << DSU_ENTRY0_FMT_Pos)                /* (DSU_ENTRY0) Format Mask */
#define DSU_ENTRY0_FMT(value)                 (DSU_ENTRY0_FMT_Msk & (_UINT32_(value) << DSU_ENTRY0_FMT_Pos)) /* Assigment of value for FMT in the DSU_ENTRY0 register */
#define DSU_ENTRY0_ADDOFF_Pos                 _UINT32_(12)                                         /* (DSU_ENTRY0) Address Offset Position */
#define DSU_ENTRY0_ADDOFF_Msk                 (_UINT32_(0xFFFFF) << DSU_ENTRY0_ADDOFF_Pos)         /* (DSU_ENTRY0) Address Offset Mask */
#define DSU_ENTRY0_ADDOFF(value)              (DSU_ENTRY0_ADDOFF_Msk & (_UINT32_(value) << DSU_ENTRY0_ADDOFF_Pos)) /* Assigment of value for ADDOFF in the DSU_ENTRY0 register */
#define DSU_ENTRY0_Msk                        _UINT32_(0xFFFFF003)                                 /* (DSU_ENTRY0) Register Mask  */


/* -------- DSU_ENTRY1 : (DSU Offset: 0x1004) ( R/ 32) CoreSight ROM Table Entry 1 -------- */
#define DSU_ENTRY1_RESETVALUE                 _UINT32_(0x00)                                       /*  (DSU_ENTRY1) CoreSight ROM Table Entry 1  Reset Value */

